package Stack2.계산기1_1222;

import java.util.Scanner;
import java.util.Stack;

public class Solution {

	public static void main(String[] args) {
//		Scanner sc = new Scanner(System.in);
		Scanner sc = new Scanner(input);
		
		int T = 10;
		for (int t = 1; t <= T; t++) {
			int len = sc.nextInt();
			String f = sc.next();
			
			Stack<Character> op = new Stack<>();			
			
			String p = "";
			for (int i = 0; i < len; i++) {
				char c = f.charAt(i);
				if (c == '+') op.add(c);
				else p += c;
			}
			
			while (!op.isEmpty()){
				p += op.pop();
			}
			
			
			Stack<Integer> ev = new Stack<>();
			
			for (int i = 0; i < p.length(); i++) {
				char c = p.charAt(i);
				if (c == '+') {
					int b = ev.pop();
					int a = ev.pop();
					ev.add(a + b);
				} else ev.add(c - '0');
				
			}
			
			System.out.println(String.format("#%d %d", t, ev.pop()));
			
			
		}
		
		sc.close();
	}
	
	public static String input = "101\r\n" + 
			"9+8+5+9+2+4+1+8+3+9+3+8+7+8+6+8+9+4+1+1+7+6+1+5+8+7+6+9+6+3+1+3+1+7+5+9+2+8+4+3+7+3+4+7+3+4+8+3+2+6+6\r\n" + 
			"83\r\n" + 
			"7+4+8+3+4+8+5+5+3+6+7+1+2+5+6+5+5+6+1+6+7+8+6+4+7+4+3+1+6+1+2+1+6+8+6+9+2+7+4+3+2+3\r\n" + 
			"119\r\n" + 
			"9+4+7+9+1+3+5+4+7+4+1+3+3+4+9+9+6+2+7+7+3+4+4+7+2+7+9+7+9+9+4+5+9+2+9+8+4+8+8+2+4+6+8+7+5+3+7+7+6+9+8+3+3+4+6+8+3+8+7+9\r\n" + 
			"61\r\n" + 
			"3+7+9+5+6+4+9+3+4+2+1+3+6+5+3+6+5+7+1+7+7+4+5+2+1+9+2+4+3+7+9\r\n" + 
			"67\r\n" + 
			"9+3+8+7+2+6+1+1+3+8+2+9+3+9+1+9+3+5+3+2+1+6+2+4+3+5+6+1+2+7+7+5+4+2\r\n" + 
			"83\r\n" + 
			"6+1+4+4+7+6+3+9+6+9+2+5+7+7+8+8+9+6+2+3+3+9+7+2+5+1+3+7+9+4+7+3+2+9+3+3+8+1+4+4+3+4\r\n" + 
			"63\r\n" + 
			"4+5+3+3+1+2+9+9+3+9+9+7+5+6+1+1+7+1+8+8+2+9+8+8+8+7+7+5+9+3+4+9\r\n" + 
			"89\r\n" + 
			"6+1+2+1+6+8+6+8+8+9+5+7+2+1+3+4+8+5+2+2+5+5+4+8+5+3+4+5+9+5+9+2+9+4+7+2+6+8+9+6+3+2+1+2+4\r\n" + 
			"69\r\n" + 
			"6+3+3+1+8+2+4+2+5+5+4+9+2+2+1+3+5+9+3+6+4+7+1+9+1+9+3+4+2+7+2+6+9+6+5\r\n" + 
			"65\r\n" + 
			"4+3+6+8+9+5+9+4+4+9+1+9+8+9+9+2+4+6+8+6+9+5+3+9+7+3+9+5+6+5+9+7+5";

}
